# -*- coding: utf-8 -*-
# 场景 27：《Day 0》（由原作 s27.json 自动生成）

label s27:
    play sound "audio/se/typing.mp3"
    centered "{size=36}暑期集训篇 Week-1 Day-0{/size}{w=0.5}{nw}"
    play amb "audio/bgm/dragon_appears.ogg" fadein 1.0
    "..."
    play sound "audio/se/whistle.mp3"
    "醒醒 ... "
    play sound "audio/se/railway.mp3"
    "..."
    play sound "audio/se/railway.mp3"
    "醒醒 ... Kotori ..."
    play sound "audio/se/whistle.mp3"
    "或许是经过长途旅行不可避免所产生的疲惫，又或许是第一次来到一座遥远而陌生的城市所产生的不安，少女勉强从盛夏的阳光中睁开朦胧的双眼，脑海中似有似无的呼喊声也终于开始消退。"
    # 〔添加材质/滤镜效果，重制版略〕
    scene bg_train at fullscreen, gcoffset(4, -19) with dissolve
    "那个 OI 败犬，也就是眼前 ID 名为栗原小鸟（Kurihara Kotori）的少女，\n于动荡摇晃的车厢中，从循环往复的噩梦中逐渐苏醒，\n此刻还不知道，前方等待自己的，又是怎样一段幸福的受虐之旅。"
    "信息学竞赛，英文名 Olympiad Informatics，通常缩写为 OI，\n特指以程序设计为基础的中学生学科竞赛。\n而信息学竞赛的选手则自称自己为 —— OIer。"
    "虽然 OI 起步较晚，也不像数学、物理等科⽬⼀样属于⾼考考察的范围。\nOI 依然以其独特的魅力，跻身五大学科竞赛之列。"
    "栗原小鸟正是一名 OIer，进一步，\n更是一名停课搞 OI、最终幸免于高考的\n一名令绝大多数学生都会羡慕的 OIer 保送生。"
    "七月的阳光透过窗帘射进车厢之中，\n即便是在北纬 45° 的哈尔滨，\n依然可以感受到扑面而来的热浪。\n我们的故事就在这样繁茂的盛夏中悄无声息的开始了 ..."
    "身旁的那个人正是我的父亲，\n说是担心我第一次出远门才一起陪同，\n不过今晚大概就会去陪他的哪个老情人吧？\n即使是在这样一座陌生的城市 ..."
    scene bg_020 at fullscreen with dissolve
    play sound "audio/se/footsteps.mp3"
    "从车站到学校的路程很近，"
    "在学校门口我向父亲告别，总算甩开了这个讨厌的家伙，\n那么接下来的时间，终于开始属于自己了。"
    "HIT，\n这所在北方首屈一指的高校，985 工程，九校联盟之一，\n在这座城市，几乎是所有中学生梦寐以求的理想学府，\n连出租车上的司机当知道你的目的地是这里时也能愉快的和你唠上一路。"
    "然而对我来说，却只是一个没有选择的选择。"
    "因为高二搞 OI 停课，我的文化课成绩在高三时已经接近爆炸，\n因为没进过省队，没有办法保送更为理想的学校。\n最后居然依靠着理科实验班的 Quota，通过联赛一等奖混了个保送名额，\n大概是不会有其他同学看上这所学校来和我竞争这个名额的吧？"
    "虽然避免了我更害怕、变数也更大的高考，\n但也因此成为了我的一个心结，\n这份屈辱和不甘怎么能够忘记 ..."
    "笔直的绿茵大道，道路两边排满了各种学院和社团的海报。\n看来即使是暑假，这所学校的学生们也依然忙碌。"
    "我路过了几张记载有航天和人造卫星成就的海报下。\n然而海报上的内容对我来说都完全没有吸引力，\n因为我来这所学校的目的只有一个 ...\n—— 哪里跌倒就在哪里爬起来。"
    play sound "audio/se/footsteps.mp3"
    scene bg_018 at fullscreen with dissolve
    "正心楼，\n这里是我和 Larry 学长约定相见的地方，"
    kotori "「あの，すみません...\n请问 Larry 学长在这里吗...」"
    "..."
    kotori "「あの，すみません...」"
    "..."
    "不知是我的声音太小，还是大家都在专注着写题的缘故。\n似乎并没有人发现机房里多了一个人。\n我一动不动的呆在原地。"
    "最后排的学长似乎发现了我的存在。\n朝我走来。"
    oneplus "「你好，我是 OnePlus，\n你是 Kotori 学长吗？」"
    kotori "「そ、そうです。\n请问 Larry 学长 ...」"
    "眼前的人似乎并不是 Larry？此前在网上人肉过照片。\n虽然我明明是新手，也被称为学长，\n看来这是集训队的标准称谓。\n我很快就领会到了这一点。"
    oneplus "「Larry 学长已经毕业，昨天傍晚已经离开哈尔滨了，\n临走之后他特地和我们嘱咐，今天机房会来一位小美女。」"
    "教室里的其他人也注意过来，\n听到议论和笑声..."
    "好吧，我知道我不是美女，\n学长大概在网上被我骗了。\n但是这一点也不好笑。"
    oneplus "「这是 Larry 学长的饭卡和宿舍的钥匙。\n你是第一次来 HIT 吧，我带你认识一下宿舍吧。」"
    scene bg_020 at fullscreen with dissolve
    # 注释: （立绘，学校）
    # 注释: 
    # 注释: 
    # 注释: （一段风物描写 和 Kotori 内心活动）
    # 注释: 
    # 注释: （到达宿舍门口）
    # 注释: 没有背景板先放这个替代一下了……
    oneplus "「这里就是研究生宿舍了，\n在正式开学之前，准新生会先安排在这里。」"
    kotori "「谢谢学长...」"
    oneplus "「有什么问题想要问我吗？」"
    pause 1.00

label s27_selections1:
    menu:
        "关于集训的内容":
            oneplus "「关于集训的课表和讲师之前已经发在论坛和群里了。」"
            oneplus "Week1\n月曜日 Day 1 数据结构-1\n火曜日 Day 2 动态规划-1\n水曜日 Day 3 状态空间搜索-1\n木曜日 Day 4 状态空间搜索-1\n金曜日 Day 5 数据结构-2\n土曜日 Day 6 比賽\n日曜日 Day 7 自由活動"
            oneplus "Week2\n月曜日 Day 1 图论-1\n火曜日 Day 2 图论-2\n水曜日 Day 3 数论-1\n木曜日 Day 4 字符串-1\n金曜日 Day 5 计算几何-1\n土曜日 Day 6 比賽\n日曜日 Day 7 自由活動"
            oneplus "别迟到了哦。"
            jump s27_selections1
        "关于吃饭的地方":
            oneplus "「刚才我们路过的两栋楼就是食堂所在的地方。\n以及对面的这栋黑色屋檐的建筑，我们一般叫做「黑店」，\n虽然叫「黑店」，但是价格也并不黑，里面也有很多餐厅。\n当然校园周围也有很多可以吃饭的地方。」"
            jump s27_selections1
        "关于其他 OIer 新生":
            oneplus "「似乎还有一名选手，是会明天才过来。」"
            jump s27_selections1
        "关于 Larry 学长的去向":
            oneplus "「Larry 学长今年已经毕业了，\n似乎去了哪家公司搬砖。」"
            jump s27_selections1
        "关于选拔考试":
            oneplus "「第一周和第二周的周六分辨会有两场考试，\n集训队会根据考试的结果选拔今年区域赛的选手。」"
            jump s27_selections1
        "谢谢 ...":
            pass
    oneplus "「今天时间也不早了，你先早点回宿舍休息吧。\n记得明天早上 8:00 来机房参加集训。」"
    kotori "「学长。。OnePlus 学长去哪里呢？」"
    oneplus "「我继续回机房参加训练了，\n毕竟对我们大三的选手来说每天的训练时间都很宝贵。」"
    "在这盛夏时节，不去度假却选择在这种闷热的地方对着电脑编程。\n看来大家都一定有自己的梦想吧。\n没错，我也是这样 ..."
    oneplus "「啊，对了，这是我的联络方式。\n在宿舍遇到问题的话，可以来找我们。」"
    kotori "「谢.. 谢谢。」"
    "（通信录追加，OnePlus++）"
    scene black with dissolve  # 消除图像
    scene bg_h012a at fullscreen with dissolve
    "虽然是条件相对较好的研究生宿舍，\n但是看起来也比高中的时候差了很多。\n宿舍的室友赤膊着打着游戏。\n我对他们的活动并不关心。"
    "一切都是 Steins Gate 的选择。\n我躺在床上戴上耳机，继续追《命运石之门》。\n我甚至把手机铃声换成了游戏里的\n不过这么小众的游戏，应该不会有人注意到吧。。。"
    "啊，我也希望能够成为「时间跳跃者」啊。。。\n要是我也能够持有 D-mail 那样的东西的话..."
    play sound "audio/se/yumenikki.mp3"
    # 〔添加材质/滤镜效果，重制版略〕
    "..."
    jump s28  # 更换场景 -> 生日礼物
