# -*- coding: utf-8 -*-
# 场景 9：《冲突》（由原作 s9.json 自动生成）

label s9:
    play sound "audio/se/knock.mp3"
    "咚咚咚。"
    play sound "audio/se/knock.mp3"
    "咚咚咚！"
    play sound "audio/se/knock.mp3"
    "砰砰砰砰！！"
    # 〔画面特效，重制版略〕
    scene bg_h003c at fullscreen, gcoffset(-3, -82) with dissolve
    "..."
    "门外传来急促的敲门声。\n很急，"
    "愈发的快，愈发的用力，充满了压迫的感觉\n让人感到，仿佛恶鬼催命一般\n脊背发凉，"
    "慌忙地打开门。"
    "看见他的身影，我稍微感到了一点惊讶。\n父亲很少回家，很少\n我上下打量着他，他也仿佛看陌生人一样打量着我。"
    kotori e18 "爸爸... 晚上好..."
    father "..."
    "父亲没有理会我，而是坐在客厅的椅子上抽烟。\n一瞬间，我的喉咙仿佛卡住了一样，\n也许是关心他的话，也许是应付他的话，\n所有说出口的话，都被咽进了肚子里。"
    "我慢慢的踱回书房，继续写今天的作业。"
    "..."
    "约莫一根烟抽完，房门被打开了。\n父亲的身影站在房间口，几乎堵住了整个门。\n香烟的味道紧接着扑面而来"
    "他走进房间，被烟熏黄的手指随手夹起了一张微皱，\n写满了密密麻麻的题目与回答的试卷，\n他的瞟向试卷开头，布满皱纹的眉头立刻紧缩起来。"
    father "90 分...为什么这次数学只考了 90 分？"
    "仿佛拷问一般的语气，压得我喘不过气"
    kotori e15 "这次的数学试卷比较难...班里 90 分以上的也只有 20 多个..."
    "感到被威压，被紧逼，自己好像是恐慌的小兔，面对恶狼的威胁，蜷缩着瑟瑟发抖"
    father "那就是排到 20 名往后了？"
    "父亲的手愈发紧握着试卷，卷面上的几处红叉显得格外的刺眼。"
    "空气仿佛凝固了"
    "我低着头，紧张和恐惧，连呼吸都开始小心翼翼。"
    # 〔移动图片/渐变 30帧〕
    "沉默了许久... 他望着还在闪烁着 Turbo Pascall \n特有的蓝底白字界面的 CRT 显示器 ...\n不安的预感环绕着我的全身。"
    father "这次成绩退步，肯定是平常玩电脑游戏导致的。"
    "他的语气里含着被极力压抑的愤怒"
    father "这次就先把你的电脑机箱带走，等到你成绩恢复的时候再还给你。"
    "我的心里一颤"
    kotori e18 "可是晚上我们要用机器写题目啊。。。\n没有了电脑我没有办法训练。。。"
    "哪怕是最后，极力的想要挽回，发自内心的不满，反驳，\n却还是像受惊的幼兔一样蹑手蹑脚。"
    father "还嘴硬！明明每次回家都看你在玩游戏。"
    "不由分说，他就上前，试图一口气拔下了插在电脑机箱上的所有排线。\n我慌忙地起身，试图阻止他。\n而我的“至少先把电源关掉”甚至还没来得及说出口。\n一股粗暴的推力就将我推倒在桌子上。"
    # 〔画面特效，重制版略〕
    "失去平衡的眩晕，和撞击的疼痛让我的脑袋一片空白。\n耳边传来了重物砸落在地的声音\n电脑机箱在推搡中被碰倒在地。"
    kotori e18 "（痛。。。）"
    "机箱无助地摔在地上，被扯断的接线散落在地。\n强力的震动似乎让摔坏了主板上的不少固件，\n还连接着的显示屏开始显示代表着死机的雪花。"
    father "怎么，考试没考好，翅膀到硬了？\n罚你把这张卷子错误的题目抄 10 遍！"
    father "如果电脑坏了，就买一台新的。\n下次考回前 3 名的时候，再把电脑还给你。"
    "摔下了话，他拖着在地上吱呀惨叫的机箱，头也不回的离开"
    "我吓得不敢出声，乖乖的坐在椅子上\n一边埋下头，照做着抄写\n不争气的眼泪一滴一滴滴落下来\n打湿了试卷"
    "父亲不知道的是，对我真正重要的，是硬盘里的 100\n多道题目的程序。\n仿佛毕生的心血被夺走，被摧毁，被践踏。\n如同噩梦\n。。。"
    # 〔添加材质/滤镜效果，重制版略〕
    "。。。"
    jump chapter_select  # 更换场景 -> 选剧本
